## Cleaning data in Python

+ Using `assert` statements to verify data quality
+ Some data might appear to be numeric but actually be categorical
  + e.g. `marriage_status`: 0 = never married, 1 = married, 2 = separated, 3 = divorced
  + used `.astype('category')` as described in the **Working with Categorical Data in Python** course.
  + after using `.astype('category')` on a categorical column, running `describe()` will make more sense (better alignment)

In [1]:
import pandas as pd

df_ride_sharing = pd.read_csv('./data/ride_sharing_new.csv')
df_ride_sharing.head()

,Unnamed: 0,duration,station_A_id,station_A_name,station_B_id,station_B_name,bike_id,user_type,user_birth_year,user_gender
0,0,12 minutes,81,Berry St at 4th St,323,Broadway at Kearny,5480,2,1959,Male
1,1,24 minutes,3,Powell St BART Station (Market St at 4th St),118,Eureka Valley Recreation Center,5193,2,1965,Male
2,2,8 minutes,67,San Francisco Caltrain Station 2 (Townsend St...,23,The Embarcadero at Steuart St,3652,3,1993,Male
3,3,4 minutes,16,Steuart St at Market St,28,The Embarcadero at Bryant St,1883,1,1979,Male
4,4,11 minutes,22,Howard St at Beale St,350,8th St at Brannan St,4626,2,1994,Male

In [2]:
# Print the information of ride_sharing
print(df_ride_sharing.info(), "\n")

# Print summary statistics of user_type column
print(df_ride_sharing['user_type'].describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25760 entries, 0 to 25759
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       25760 non-null  int64
 1   duration         25760 non-null  object
 2   station_A_id     25760 non-null  int64
 3   station_A_name   25760 non-null  object
 4   station_B_id     25760 non-null  int64
 5   station_B_name   25760 non-null  object
 6   bike_id          25760 non-null  int64
 7   user_type        25760 non-null  int64
 8   user_birth_year  25760 non-null  int64
 9   user_gender      25760 non-null  object
dtypes: int64(6), object(4)
memory usage: 2.0+ MB
None

count    25760.000000
mean         2.008385
std          0.704541
min          1.000000
25%          2.000000
50%          2.000000
75%          3.000000
max          3.000000
Name: user_type, dtype: float64

In [3]:
# Print the information of ride_sharing
print(df_ride_sharing.info(), "\n")

# Print summary statistics of user_type column
print(df_ride_sharing['user_type'].describe(), "\n")

# Convert user_type from integer to category
df_ride_sharing['user_type_cat'] = df_ride_sharing['user_type'].astype('category')

# Write an assert statement confirming the change
assert df_ride_sharing['user_type_cat'].dtype == 'category'

# Print new summary statistics 
print(df_ride_sharing['user_type_cat'].describe(), "\n")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25760 entries, 0 to 25759
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       25760 non-null  int64
 1   duration         25760 non-null  object
 2   station_A_id     25760 non-null  int64
 3   station_A_name   25760 non-null  object
 4   station_B_id     25760 non-null  int64
 5   station_B_name   25760 non-null  object
 6   bike_id          25760 non-null  int64
 7   user_type        25760 non-null  int64
 8   user_birth_year  25760 non-null  int64
 9   user_gender      25760 non-null  object
dtypes: int64(6), object(4)
memory usage: 2.0+ MB
None

count    25760.000000
mean         2.008385
std          0.704541
min          1.000000
25%          2.000000
50%          2.000000
75%          3.000000
max          3.000000
Name: user_type, dtype: float64

count     25760
unique        3
top           2
freq      12972
Name: user_type_cat, dtype: int64

In [4]:
# Strip duration of minutes
df_ride_sharing['duration_trim'] = df_ride_sharing['duration'].str.strip('minutes')

# Convert duration to integer
df_ride_sharing['duration_time'] = df_ride_sharing['duration_trim'].astype(int)

# Write an assert statement making sure of conversion
assert df_ride_sharing['duration_time'].dtype == 'int'

## Data range constraints

+ To follow along with the lectures, the `tire_size` and `ride_date` columns needed to be added to the data
  + The code to add these columns is commented out because they only needed to be run once.

In [5]:
print(df_ride_sharing.shape)
df_ride_sharing.columns

(25760, 13)

Index(['Unnamed: 0', 'duration', 'station_A_id', 'station_A_name',
       'station_B_id', 'station_B_name', 'bike_id', 'user_type',
       'user_birth_year', 'user_gender', 'user_type_cat', 'duration_trim',
       'duration_time'],
      dtype='object')

In [6]:
import numpy as np
import random

# # add a tire_sizes column (because it doesn't exist in the original data) to illustrate
# tire_sizes = [26, 27, 29]
# tire_size_probabilities = 100 * np.array([0.485, 0.313, 0.202])  # these were the proportions found on the execise data
# df_ride_sharing['tire_sizes'] = random.choices(tire_sizes, weights=tuple(tire_size_probabilities), k=df_ride_sharing.shape[0])
# # check that values follow specified distribution
# df_ride_sharing['tire_sizes'].value_counts(normalize=True)  # looks good:
# tire_sizes
# 26    0.487189
# 27    0.314946
# 29    0.197865

In [7]:
# write df with new column added
# df_ride_sharing.to_csv('./data/ride_sharing.csv')

In [8]:
# re-read the ride sharing data file with the new column
df_ride_sharing = pd.read_csv('./data/ride_sharing.csv')

# Convert tire_sizes to integer
df_ride_sharing['tire_sizes'] = df_ride_sharing['tire_sizes'].astype('int')

# Set all values above 27 to 27
df_ride_sharing.loc[df_ride_sharing['tire_sizes'] > 27, 'tire_sizes'] = 27

# Reconvert tire_sizes back to categorical
df_ride_sharing['tire_sizes'] = df_ride_sharing['tire_sizes'].astype('category')

# Print tire size description
print(df_ride_sharing['tire_sizes'].describe())

count     25760
unique        2
top          27
freq      13210
Name: tire_sizes, dtype: int64

In [9]:
import datetime as dt

# generate random dates between 5 years ago and 1 year into the future
# which is roughly what the exercise data was found to be
# rand_dates = []
# today_date = dt.date.today()
# for date_row in range(df_ride_sharing.shape[0]):
#     # https://stackoverflow.com/questions/553303/how-to-generate-a-random-date-between-two-other-dates#61383231
#     rand_delta = random.randint(-5*365, 365)
#     rand_date = today_date + dt.timedelta(days=rand_delta)
#     rand_dates.append(rand_date.strftime("%Y-%m-%d"))

# df_ride_sharing['ride_date'] = rand_dates
# print(df_ride_sharing['ride_date'].iloc[:11])  # looks good

In [10]:
# write df with new column added
# df_ride_sharing.to_csv('./data/ride_sharing.csv')

In [11]:
# Convert ride_date to date
df_ride_sharing['ride_dt'] = pd.to_datetime(df_ride_sharing['ride_date']).dt.date

# Save today's date
today = dt.date.today()

# Set all in the future to today's date
df_ride_sharing.loc[df_ride_sharing['ride_dt'] > today, 'ride_dt'] = today

# Print maximum of ride_dt column
print(df_ride_sharing['ride_dt'].max())

2025-04-08

## Uniqueness contraints - dealing with duplicates

+ The height and weight data file used for these lectures was **not** provided, so it was generated using ChatGPT with the prompt saved in the file `data/chat_gpt_prompt_data_gen.txt`. The resulting data file is provided in `data/height_weight_cgpt.csv`

### The `duplicated()` method

+ `subset` parameter: List of column names to check for duplication.
+ `keep` parameter: Whether to keep first (`'first'`), last (`'last'`) or all (`False`) duplicate values

In [12]:
height_weight = pd.read_csv('./data/height_weight_cgpt.csv', index_col='index')
height_weight.head()  # same output as slide 33 of 46 in chapter1.pdf

      first_name last_name                       address  height  weight
index
0           Lane     Reese              534-1559 Nam St.     181      64
1           Ivor    Pierce             102-3364 Non Road     168      66
2          Roary    Gibson   P.O. Box 344, 7785 Nisi Ave     191      99
3        Shannon    Little  691-2550 Consectetuer Street     185      65
4          Abdul       Fry                4565 Risus St.     169      65

In [13]:
# get duplicates across all columns
duplicates = height_weight.duplicated()
print(duplicates.iloc[[0,1,2,3,22,23,99,100,101,102,103]])

index
0      False
1      False
2      False
3      False
22     False
23     False
99     False
100     True
101    False
102     True
103    False
dtype: bool

In [14]:
height_weight[duplicates]  # same output as slide 35 of 46 in chapter1.pdf

      first_name last_name          address  height  weight
index
100         Mary     Colon      4674 Ut Rd.     179      75
102         Cole    Palmer  8366 At, Street     178      91

In [15]:
 # Column names to check for duplication 
column_names = ['first_name','last_name','address'] 
duplicates = height_weight.duplicated(subset = column_names, keep = False)
height_weight[duplicates]  # same output as slide 37 of 46 in chapter1.pdf

,first_name,last_name,address,height,weight
index,,,,,
1,Ivor,Pierce,102-3364 Non Road,168,66
22,Cole,Palmer,"8366 At, Street",178,91
28,Desirae,Shannon,"P.O. Box 643, 5251 Consectetuer, Rd.",195,83
37,Mary,Colon,4674 Ut Rd.,179,75
100,Mary,Colon,4674 Ut Rd.,179,75
101,Ivor,Pierce,102-3364 Non Road,168,88
102,Cole,Palmer,"8366 At, Street",178,91
103,Desirae,Shannon,"P.O. Box 643, 5251 Consectetuer, Rd.",196,83

In [16]:
# visualizing the duplicates is easier when sorted propertly
height_weight[duplicates].sort_values(by='first_name')  # first & last pairs: just drop the extras
                                                        # middle 2 pairs require decisions

,first_name,last_name,address,height,weight
index,,,,,
22,Cole,Palmer,"8366 At, Street",178,91
102,Cole,Palmer,"8366 At, Street",178,91
28,Desirae,Shannon,"P.O. Box 643, 5251 Consectetuer, Rd.",195,83
103,Desirae,Shannon,"P.O. Box 643, 5251 Consectetuer, Rd.",196,83
1,Ivor,Pierce,102-3364 Non Road,168,66
101,Ivor,Pierce,102-3364 Non Road,168,88
37,Mary,Colon,4674 Ut Rd.,179,75
100,Mary,Colon,4674 Ut Rd.,179,75

In [17]:
# easy case: drop duplicates with all col values the same
height_weight.drop_duplicates(inplace = True)

In [18]:
# what we have left after removing "easy" duplicate values 
column_names = ['first_name','last_name','address'] 
duplicates = height_weight.duplicated(subset = column_names, keep = False) 
height_weight[duplicates].sort_values(by = 'first_name')

,first_name,last_name,address,height,weight
index,,,,,
28,Desirae,Shannon,"P.O. Box 643, 5251 Consectetuer, Rd.",195,83
103,Desirae,Shannon,"P.O. Box 643, 5251 Consectetuer, Rd.",196,83
1,Ivor,Pierce,102-3364 Non Road,168,66
101,Ivor,Pierce,102-3364 Non Road,168,88

In [19]:
# Group by column names and use max for height and mean for weight
column_names = ['first_name','last_name','address'] 
summaries = {'height': 'max', 'weight': 'mean'}
# Next line will only change non-easy duplicates and reset the index
height_weight = height_weight.groupby(by = column_names).agg(summaries).reset_index() 
# Make sure aggregation is done 
duplicates = height_weight.duplicated(subset = column_names, keep = False) 
height_weight[duplicates].sort_values(by = 'first_name')

Empty DataFrame
Columns: [first_name, last_name, address, height, weight]
Index: []

## Membership constraints - Text and categorical data problems

+ Predefined finite set of categories - **Examples:**
  + Marriage Status (binary) = {`unmarried`, `married`} or {0, 1}
  + Household Income Category = {`0-20k`, `20-40k`, `40-80k`, ...} or {0, 1, 2, ...}
  + Loan Status: {`default`, `payed`, `no_loan`} or {0, 1, 2}
+ Types of problem:
  + Date Entry Errors
  + Parsing Errors
+ Typical remedies:
  + drop data
  + remap categories
  + infer categories

In [20]:
# Read study data and print it, (not provided, so recreated manually)
study_data = pd.read_csv('./data/study.csv', index_col='index')
# correct categories
categories = pd.read_csv('./data/study_categories.csv', index_col='index')
# remove the index labels to match lecture slides
study_data.index.names = ['']
categories.index.names = ['']
print(study_data)
print(categories)

       name    birthday blood_type

1      Beth  2019-10-20         B-
2  Ignatius  2020-07-08         A-
3      Paul  2019-08-12         O+
4     Helen  2019-03-17         O-
5  Jennifer  2019-12-17         Z+
6   Kennedy  2020-04-27         A+
7     Keith  2019-04-19        AB+
  blood_type

1         O-
2         O+
3         A-
4         A+
5         B+
6         B-
7        AB+
8        AB-

In [21]:
study_data.columns

Index(['name', 'birthday', 'blood_type'], dtype='object')

In [22]:
# find inconsistent data
inconsistent_categories = set(study_data['blood_type']).difference(categories['blood_type']) 
print(inconsistent_categories)

{'Z+'}

In [23]:
inconsistent_categories = set(study_data['blood_type']).difference(categories['blood_type']) 
inconsistent_rows = study_data['blood_type'].isin(inconsistent_categories) 
inconsistent_data = study_data[inconsistent_rows]  
# Drop inconsistent categories and get consistent data only
consistent_data = study_data[~inconsistent_rows]
consistent_data

       name    birthday blood_type

1      Beth  2019-10-20         B-
2  Ignatius  2020-07-08         A-
3      Paul  2019-08-12         O+
4     Helen  2019-03-17         O-
6   Kennedy  2020-04-27         A+
7     Keith  2019-04-19        AB+

### Pre-defined categories and airline data

In [24]:
airlines = pd.read_csv('./data/airlines_dirty.csv', index_col=[0])
print(airlines.shape)
airlines.head()

(2477, 12)

,id,day,airline,destination,dest_region,dest_size,boarding_area,dept_time,wait_min,cleanliness,safety,satisfaction
0,1351,Tuesday,UNITED INTL,KANSAI,Asia,Hub,Gates 91-102,2018-12-31,115.0,Clean,Neutral,Very satisfied
1,373,Friday,ALASKA,SAN JOSE DEL CABO,Canada/Mexico,Small,Gates 50-59,2018-12-31,135.0,Clean,Very safe,Very satisfied
2,2820,Thursday,DELTA,LOS ANGELES,West US,Hub,Gates 40-48,2018-12-31,70.0,Average,Somewhat safe,Neutral
3,1157,Tuesday,SOUTHWEST,LOS ANGELES,West US,Hub,Gates 20-39,2018-12-31,190.0,Clean,Very safe,Somewhat satsified
4,2992,Wednesday,AMERICAN,MIAMI,East US,Hub,Gates 50-59,2018-12-31,559.0,Unacceptable,Very safe,Somewhat satsified

In [25]:
# airline categories - create manually because they weren't included with course
# airline_cats = pd.DataFrame({
#     'cleanliness': ['Clean', 'Average', 'Somewhat clean', 'Somewhat dirty', 'Dirty'],
#     'safety': ['Neutral', 'Very safe', 'Somewhat safe', 'Very unsafe', 'Somewhat unsafe'],
#     'satisfaction': ['Very satisfied', 'Neutral', 'Somewhat satisfied', 'Somewhat unsatisfied', 'Very unsatisfied']  
# })

# airline_cats.to_csv("./data/airlines_cats.csv")

In [26]:
# Read the airlines categories file
airline_cats = pd.read_csv("./data/airlines_cats.csv", index_col=[0])

# Print categories DataFrame
print(airline_cats)

# Print unique values of survey columns in airlines
print('Cleanliness: ', airlines['cleanliness'].unique(), "\n")
print('Safety: ', airlines['safety'].unique(), "\n")
print('Satisfaction: ', airlines['satisfaction'].unique(), "\n")

      cleanliness           safety          satisfaction
0           Clean          Neutral        Very satisfied
1         Average        Very safe               Neutral
2  Somewhat clean    Somewhat safe    Somewhat satisfied
3  Somewhat dirty      Very unsafe  Somewhat unsatisfied
4           Dirty  Somewhat unsafe      Very unsatisfied
Cleanliness:  ['Clean' 'Average' 'Unacceptable' 'Somewhat clean' 'Somewhat dirty'
 'Dirty']

Safety:  ['Neutral' 'Very safe' 'Somewhat safe' 'Very unsafe' 'Somewhat unsafe']

Satisfaction:  ['Very satisfied' 'Neutral' 'Somewhat satsified' 'Somewhat unsatisfied'
 'Very unsatisfied']

### Airline category consistency

The `cleanliness` attribute has one or more `Unacceptable` rows. Which ones are they?

In [27]:
# Find the cleanliness category in airlines not in categories
cat_clean = set(airlines['cleanliness']).difference(airline_cats['cleanliness'])

# Find rows with that category
cat_clean_rows = airlines['cleanliness'].isin(cat_clean)

# Print rows with inconsistent category
print(airlines[cat_clean_rows])

       id        day           airline  destination  dest_region dest_size  \
4    2992  Wednesday          AMERICAN        MIAMI      East US       Hub
18   2913     Friday  TURKISH AIRLINES     ISTANBUL  Middle East       Hub
100  2321  Wednesday         SOUTHWEST  LOS ANGELES      West US       Hub

    boarding_area   dept_time  wait_min   cleanliness         safety  \
4     Gates 50-59  2018-12-31     559.0  Unacceptable      Very safe
18   Gates 91-102  2018-12-31     225.0  Unacceptable      Very safe
100   Gates 20-39  2018-12-31     130.0  Unacceptable  Somewhat safe

           satisfaction
4    Somewhat satsified
18   Somewhat satsified
100  Somewhat satsified

## Typical errors with categorical data

+ Value inconsistency
  + inconsistent fields: `married`, `Maried`, `UNMARRIED`, `non married`...
  + trailing white spaces: `married `, ` married `,
+ Too many categories
  +  collapse into managable groups: `0-20k`, `20-40k`, `40-60k`,...
  +  map groups to new ones: `rich`, `poor`
+ Make sure data is of type `category`

In [28]:
# Print unique values of both columns
print(airlines['dest_region'].unique(), "\n")  # 'East US' vs 'EAST US', 'Middle East' vs 'middle east'
print(airlines['dest_size'].unique())

['Asia' 'Canada/Mexico' 'West US' 'East US' 'Midwest US' 'EAST US'
 'Middle East' 'Europe' 'eur' 'Central/South America'
 'Australia/New Zealand' 'middle east']

['Hub' 'Small' '    Hub' 'Medium' 'Large' 'Hub     ' '    Small'
 'Medium     ' '    Medium' 'Small     ' '    Large' 'Large     ']

In [29]:
# Print unique values of both columns
print(airlines['dest_region'].unique())
print(airlines['dest_size'].unique(), "\n")

# Lower dest_region column and then replace "eur" with "europe"
airlines['dest_region'] = airlines['dest_region'].str.lower() 
airlines['dest_region'] = airlines['dest_region'].replace({'eur':'europe'})

# Remove white spaces from `dest_size`
airlines['dest_size'] = airlines['dest_size'].str.strip()

# Verify changes have been effected
print(airlines['dest_region'].unique())
print(airlines['dest_size'].unique())

['Asia' 'Canada/Mexico' 'West US' 'East US' 'Midwest US' 'EAST US'
 'Middle East' 'Europe' 'eur' 'Central/South America'
 'Australia/New Zealand' 'middle east']
['Hub' 'Small' '    Hub' 'Medium' 'Large' 'Hub     ' '    Small'
 'Medium     ' '    Medium' 'Small     ' '    Large' 'Large     ']

['asia' 'canada/mexico' 'west us' 'east us' 'midwest us' 'middle east'
 'europe' 'central/south america' 'australia/new zealand']
['Hub' 'Small' 'Medium' 'Large']

In [30]:
# Create ranges for categories
label_ranges = [0, 60, 180, np.inf]
label_names = ['short', 'medium', 'long']

# Create wait_type column
airlines['wait_type'] = pd.cut(airlines['wait_min'], bins = label_ranges, 
                               labels = label_names)

# Create mappings and replace
mappings = {'Monday':'weekday', 'Tuesday':'weekday', 'Wednesday': 'weekday', 
            'Thursday': 'weekday', 'Friday': 'weekday', 
            'Saturday': 'weekend', 'Sunday': 'weekend'}

airlines['day_week'] = airlines['day'].replace(mappings)

print(airlines.columns)
airlines[['wait_type', 'day_week']].head()

Index(['id', 'day', 'airline', 'destination', 'dest_region', 'dest_size',
       'boarding_area', 'dept_time', 'wait_min', 'cleanliness', 'safety',
       'satisfaction', 'wait_type', 'day_week'],
      dtype='object')

  wait_type day_week
0    medium  weekday
1    medium  weekday
2    medium  weekday
3      long  weekday
4      long  weekday

## Text data and regex

+ data inconsistencies
+ fixed length violations
+ typos
+ tbd

In [31]:
phones = pd.read_csv("./data/phones.csv", header=0)
phones  # row 3: inconsistent data format, row 5: length violation

            Full name      Phone number
0     Noelani A. Gray  001-702-397-5143
1      Myles Z. Gomez  001-329-485-0540
2        Gil B. Silva  001-195-492-2338
3  Prescott D. Hardin   +1-297-996-4904
4  Benedict G. Valdez  001-969-820-3536
5    Reece M. Andrews              4138
6      Hayfa E. Keith  001-536-175-8444
7     Hedley I. Logan  001-681-552-1823
8    Jack W. Carrillo  001-910-323-5265
9     Lionel M. Davis  001-143-119-9210

### Ideally, we'd like the data to look like this

In [32]:
phones_clean = pd.read_csv("./data/phones_ideally.csv", dtype={"Full name":str , "Phone number":str}, header=0)
phones_clean

            Full name   Phone number
0     Noelani A. Gray  0017023975143
1      Myles Z. Gomez  0013294850540
2        Gil B. Silva  0011954922338
3  Prescott D. Hardin  0012979964904
4  Benedict G. Valdez  0019698203536
5    Reece M. Andrews            NaN
6      Hayfa E. Keith  0015361758444
7     Hedley I. Logan  0016815521823
8    Jack W. Carrillo  0019103235265
9     Lionel M. Davis  0011431199210

In [33]:
# convert to what we want - 1) start by replacing + with 00
phones["Phone number"] = phones["Phone number"].str.replace("+", "00")
phones

            Full name      Phone number
0     Noelani A. Gray  001-702-397-5143
1      Myles Z. Gomez  001-329-485-0540
2        Gil B. Silva  001-195-492-2338
3  Prescott D. Hardin  001-297-996-4904
4  Benedict G. Valdez  001-969-820-3536
5    Reece M. Andrews              4138
6      Hayfa E. Keith  001-536-175-8444
7     Hedley I. Logan  001-681-552-1823
8    Jack W. Carrillo  001-910-323-5265
9     Lionel M. Davis  001-143-119-9210

In [34]:
# 2) eplace "-" with empty string 
phones["Phone number"] = phones["Phone number"].str.replace("-", "") 
phones

            Full name   Phone number
0     Noelani A. Gray  0017023975143
1      Myles Z. Gomez  0013294850540
2        Gil B. Silva  0011954922338
3  Prescott D. Hardin  0012979964904
4  Benedict G. Valdez  0019698203536
5    Reece M. Andrews           4138
6      Hayfa E. Keith  0015361758444
7     Hedley I. Logan  0016815521823
8    Jack W. Carrillo  0019103235265
9     Lionel M. Davis  0011431199210

In [35]:
# 3) replace phone numbers with less than 10 digits with NaN
digits = phones["Phone number"].str.len()
phones.loc[digits < 10, "Phone number"] = np.nan
phones

            Full name   Phone number
0     Noelani A. Gray  0017023975143
1      Myles Z. Gomez  0013294850540
2        Gil B. Silva  0011954922338
3  Prescott D. Hardin  0012979964904
4  Benedict G. Valdez  0019698203536
5    Reece M. Andrews            NaN
6      Hayfa E. Keith  0015361758444
7     Hedley I. Logan  0016815521823
8    Jack W. Carrillo  0019103235265
9     Lionel M. Davis  0011431199210

In [36]:
# Test fixes - find length of each row in Phone number column 
sanity_check = phones['Phone number'].str.len() 
# Assert minmum phone number length is 10 
assert sanity_check.min() >= 10 
# Assert all numbers do not have "+" or "-" 
assert phones['Phone number'].str.contains("+|-", regex=False).any() == False  # regex=False to avoid "error: nothing to repeat at position 0"